Repository: cocart-headless/cocart-jwt-authentication
Catalog: languages/cocart-jwt-authentication-*.po
Languages: fr_fr

source: The User Agent to override the server User Agent.
fr_fr: L'agent utilisateur pour remplacer l'agent utilisateur du serveur.

source: The user ID to generate the token for.
fr_fr: L'ID utilisateur pour lequel générer le jeton.

source: Generates a new JWT token for a user.
fr_fr: Génère un nouveau jeton JWT pour un utilisateur.

source: Number of tokens to display per page.
fr_fr: Nombre de jetons à afficher par page.

source: Page number to display.
fr_fr: Numéro de page à afficher.

source: Lists all active JWT tokens.
fr_fr: Répertorie tous les jetons JWT actifs.

source: The JWT token to view.
fr_fr: Le jeton JWT à afficher.

source: Displays details of a JWT token.
fr_fr: Affiche les détails d'un jeton JWT.

source: Force cleanup of all tokens.
fr_fr: Forcer le nettoyage de tous les jetons.

source: Number of users to process per batch.
fr_fr: Nombre d'utilisateurs à traiter par lot.

source: Cleans up expired JWT tokens.
fr_fr: Nettoie les jetons JWT expirés.

source: Token generated.
fr_fr: Jeton généré.

source: Are you sure you want to generate a new one?
fr_fr: Êtes-vous sûr de vouloir en générer un nouveau?

source: Generating another token will kick the user out of session
fr_fr: La génération d'un autre jeton expulsera l'utilisateur de la session

source: User not found.
fr_fr: Utilisateur non trouvé.

source: User ID is required.
fr_fr: L'identifiant utilisateur est requis.

source: No tokens found.
fr_fr: Aucun jeton trouvé.

source: Invalid token.
fr_fr: Jeton non valide.

source: Token is required.
fr_fr: Un jeton est requis.

source: User unknown!
fr_fr: Utilisateur inconnu !

source: Token is valid.
fr_fr: Le jeton est valide.

source: Refresh token expired.
fr_fr: Le jeton d'actualisation a expiré.

source: Invalid refresh token.
fr_fr: Jeton d'actualisation non valide.

source: Algorithm not supported
fr_fr: Algorithme non pris en charge

source: JWT configuration error.
fr_fr: Erreur de configuration JWT.

source: Authentication failed.
fr_fr: L'authentification a échoué.
